// while ((int n = Convert.ToInt32(Console.ReadLine())) != 0){
//     double max = 
// //Console.WriteLine(terms[]);

/*
Я не знаю как это написать на C#. Мы в цикле создаём новую переменную и сравниваем её с нулём. 
далее в цикле каждое новое число записываем в массив и как только задаётся 0 - программа выходит из цикла.
Мы имеем массив с числами. Прогоняем его в цикле for, записывая максимальное и второе по максимальности
 сравнивая их между собой и с каждым в массиве. 
 Выводим второе по максимальности. 
 Самое главное мне понять как написать программу до этапа с for, помогите)